{
    "0-20": " We are talking about the analysis of large graphs and networks and the topic we will look in the next few modules is to think about how do we do clustering of networks, right? So basically how, given a large network, how do we find interesting clusters of nodes in this network? So let me tell you more precisely what I mean by the problem. So the idea is that we, when given a large",
    "20-40": " social network or a large document network or a large communication network or a email network and so on, right, that these networks have some interesting structure that we would like to uncover or understand. And in particular the most useful level at which we can think about the structure",
    "40-60": " of networks is at the level of groups of nodes. So the idea is that we think of networks as being organized into modules, clusters, or also communities. And all these terms are synonyms for the idea that we have sets of nodes that tend to link to each other a lot and link to the rest of the networks a little. So",
    "60-80": " the idea is the following, given the network that I show you here in the slide, we kind of immediately see that there are these three clusters or three groups of nodes, right? We have the group of nodes of this red set of nodes, we have another group of kind of blue-violet set of nodes, and then the",
    "80-100": " cluster of the green nodes here at the bottom. And what is characteristic of these clusters is that for each cluster a set of nodes has a lot of connections to the other members of the clusters and few connections to the rest of the network. What is interesting in this case is that each of these three clusters kind of can further be separated into smaller clusters. For example, the green",
    "100-120": " cluster that I'm showing here is kind of composed of two separate subclusters, right? So we have the big green cluster and then we have two separate subclusters. So here we see this hierarchical structure, which is something very similar to what we have been discussing when we talked about k-means",
    "120-140": " or when we talked about hierarchical clustering. So in some sense all we want to do is we want to cluster the graph. We want to find clusters, but now in a graph data, not in a cloud of points. So the question is, how do we find these kinds of clusters and what would these clusters correspond to? In terms of",
    "140-160": " the first question, the task is in some sense nicely defined. All we want to do is the following. Given a network, we want to find sets of nodes where there are lots of connections between the members of the set and few connections to the outside of the set. So for example, given the network in this slide, what we would like to do is identify these different clusters that",
    "160-180": " here I indicated them with different colors. Of course, this is a small network and it seems like a very easy task to tell you what this network is about. Each node in this network is a scientist and two scientists are connected if they co-author the paper together. And for example, what you find",
    "180-200": " in this case is that you find different scientific areas. You find an area of scientists here that are all colored in red that work on a given topic and they co-author papers with each other. And there is another set of orange authors that are working on another topic and collaborate with it with each other. And then there is a small number of authors here that",
    "200-220": " actually also collaborate with other authors in the blue cluster. So they create these edges to the other, to the blue cluster, and so on. So our goal will be to identify these kind of clusters, densely linked sets of nodes in the networks. And of course, the hope is that these clusters correspond to something real in the data, something in some sense unexpected.",
    "220-240": " And one way to think about clusters is that these are sets of nodes that belong to the common community. So for example, in social networks, nodes in the same cluster could belong to the same social community. For example, another case where we could do this is if we look at the web search advertising example. There we can create a graph of advertisers to queries",
    "240-260": " or the keywords that the advertisers bid on. So the idea is the following. What I show you in this plot is what is called an adjacency matrix, where I can think of my graph as having this structure where on one side I have the advertisers, on the other side I have the queries or",
    "260-280": " the keywords, and I connect an advertiser to the query if I give an advertiser bids on a given query. The idea is that advertiser one wants its ads to be shown whenever somebody enters query Q1, right? And then the advertiser could link to other queries and so on. So the idea is",
    "280-300": " that now I have all the advertisers sorted on the x-axis, all the different queries one can ask on the y-axis, and the goal of clustering or graph clustering, graph community detection, is to find these sets of nodes, sets of advertisers that they all bid on the same set of queries.",
    "300-320": " So what this means is that we can think of the graph clustering in terms of what is our goal. Our goal, in a sense, is to find the ordering to sort the advertisers and sort the queries in such a way that we will find these blocks where a given set of advertisers, let's say, all bid on the",
    "320-340": " same set of queries. And if we look then, what do these advertisers have in common? What they have in common is a set of queries, and in this particular case, for example, we would learn that there is a set of advertisers that they all bid on gambling queries, and there is a subset of these advertisers denoted here that they all bid on sports betting",
    "340-360": " queries, for example. So this is an example of what a graph clustering could do. Another example where we would want to apply graph clustering is, for example, if you take the IMDB, the Internet Movie Database data, and we create a network where we have, again, a bipartite graph of all the actors and all the movies, and we connect an actor to a",
    "360-380": " movie if a given actor appeared in a given movie. So we can think of this graph where actors connect to the movies they appeared in. And now if you think about finding clusters in this kind of graph, again, what this means is that we want to find the ordering of the rows and the columns of this matrix in such a way that we find these dense patches",
    "380-400": " of edges, where it means that a given subset of authors appears in a given subset of movies. What would we expect these clusters to correspond to? We would expect them to correspond to different languages. The idea is that actors that speak Spanish, they act in Spanish movies. And it's very hard for the same actor to act both in a",
    "400-420": " Spanish, German, and let's say an English movie. So we find that actors kind of act in movies on similar language. And we see this, that, for example, we have Spanish movies, we have Brazilian movies, basically means Portuguese. Mexican movies, interesting, there is very little overlap between the actors that play in Mexican movies and in",
    "420-440": " movies made in Spain. Here is the Argentinian movie production. We have Germans down here, Italians, French, and so on. So again, taking these users to movies graph, this is what we would find doing the graph clustering or graph community detection, as it is called. Another",
    "440-460": " example is if we looked at online social networks like Facebook or Twitter, where the idea is that we want to go and find social communities, or we can call them social circles. So the idea here is the following. For example, I could take a given person, I would take all their friends and build a network among person's friends, right? So imagine this is me, every node, every black dot here represents one of",
    "460-480": " my Facebook friends. And then what I had, the black edges correspond to the friendships among my friends. And now looking at the structure of my social network, the goal would be, can we identify these clusters, sets of nodes that are friends with each other. And then once we",
    "480-500": " identify these clusters, the idea would be that we identify a set of my family members, a set of my high school friends. And then there would be also a set of my university friends, in a sense that these are, I could have a set of friends that went to the same college with me, a set of friends that is kind of embedded or nested in the set of college friends that we all attended the computer science department.",
    "500-520": " And there could be even a smaller group embedded in there that would be all the friends that had the same PhD advisor as I had, right? So this would be, for example, the idea and the methods we'll be talking about today will allow us to do this."
}