{
    "0-20": " So we start talking about our first extension or fix to the pagerink and this is called topic-specific pagerink. Sometimes it is also known as personalized pagerink. So here is basically the idea. Let's think of our initial goal. Our initial goal was to identify important pages on the web graph.",
    "20-40": " Now, of course, we don't necessarily want to find pages that are generic in popularity or that have generically high pagerink score, but we would want to say what are the web pages that are popular within a given topic or within a given domain. So in order to identify this, our goal is the following, right? What we would like to do is we would like to evaluate web pages, not just according to their overall popularity,",
    "40-60": " but also how closely they are to a particular topic or particular set of topic web pages. For example, what is their importance in terms of the sports topic or what is their importance in terms of the history topic, right?",
    "60-80": " And why is this interesting is because if we think of the web search, the way pagerink was initially thought of was that somebody will come ask a web search query. We will go identify all the web pages that are relevant towards that web search query. And then now we need to decide how to rank or how to present all these web pages to the user.",
    "80-100": " We would basically take pages, simply sort them by their pagerink score and show the pages that have the highest pagerink score first to the user. Now, of course, if you would have the personalized pagerink or topic specific pagerink way of measuring the importance of a page, we could basically show to the user a given ranking depending on what the user wants.",
    "100-120": " And in particular, there can be many queries that are ambiguous. For example, a query Trojan could have very different relevant pages depending on what is the topic you are interested in, in a sense that Trojans could mean a sports team. It can mean something different if you are interested in history,",
    "120-140": " or it can mean something very different if you are interested in Internet security. So the idea would be that we could want to compute different importance scores of different web pages based on their relation to a given topic. So the question is, how do we achieve this? And the way we will achieve this is actually to do a small but very clever trick to the pagerink formulation.",
    "140-160": " So let's think of what we have so far. So far, we talked about basically that the random walker with a very small probability can teleport from one page to any other page in the web. And we made this assumption that this teleportation of where the random walker will land,",
    "160-180": " they land uniformly at random at any other web page. So what we can do now is change this random teleportation part a bit. So in the original pagerink formulation, we said that the random walker can land at any page with equal probability. What we do in the personalized pagerink world is we say the random walker can teleport only to a topic-specific set of relevant pages.",
    "180-200": " So whenever a random walker decides to jump, they don't jump to any page on the web, but they only jump to a small subset of pages. And this subset of pages is called the teleport set.",
    "200-220": " So the idea here is in some sense that we are biasing the random walk. So the idea is that when the walker teleports, they can only teleport into a small set of pages. We call it S as the teleport set. And in our case, we can think that set S contains only pages that are relevant to a given topic.",
    "220-240": " So what this will allow us to do is basically to measure the relevance of all the other web pages on the web with regard to this given set S. So in some sense, for every set S or for every topic S, for every teleport set, we will now be able to compute a different pagerink vector R that is specific to that teleport set.",
    "240-260": " So the way we do this is actually everything is still the same as we do. All we need to do is we need to change the formulation a bit. So everything still works. The only thing we do is now we change the definition of our matrix A to be the following. If the entry i is not in the teleport set S, then basically nothing happens.",
    "260-280": " Everything is OK. But if our entry i is in the teleport set, now we add the teleport edges in a sense. So we have the beta times mij plus 1 minus beta. This is the random jump probability divided by S.",
    "280-300": " So with probability 1 minus beta, we jump into one of the S pages. So the probability of jumping to one of them is 1 over the size of the teleport set. And everything still works. A is still stochastic. Power iteration still works. Our pagerink algorithm still works.",
    "300-320": " Everything is good. Just our matrix A is now a bit different. Of course, here, for example, we are assuming that when a random walker jumps into teleport set, they jump uniformly at random into any of the pages in the teleport set. We could make things even more interesting and say that there is a probability distribution or every page has a different weight of the random walker landing at that given page.",
    "320-340": " The idea here is basically that we have lots and lots of freedom in how do we set the teleport set S. For example, when teleport set S is just a single node, this is called a random walk with restarts. And I will talk about this a bit more later.",
    "340-360": " But for now, all we need to do to understand the personalized pagerink or topic-specific pagerink is that we have this topic-specific set of pages S. This topic-specific set of pages we somehow decide. We now compute the new version of matrix A where the random walks can only jump or teleport to the entries of S.",
    "360-380": " And basically, the same machinery that we have developed so far applies in the case of topic-specific pagerink. To give you an example how this works, here is a simple graph. And what we will do is here I'm showing you first the transition probabilities.",
    "380-400": " And now let's suppose that our teleport set is a single node S and our beta is 0.8. So now, given these values, I updated the transition probabilities. So because with probability 0.2, a random walker can jump out of every node and then they can only jump back to the node 1.",
    "400-420": " So with probability 0.2, the random walker will land at node 1. And with the remaining probabilities, we see the transitions. And now if we run the power method and see where it converges to, here are the pagerink scores of the nodes under this case.",
    "420-440": " What we see, for example, is that node 1 has the highest pagerink score. Nodes 3 and 4 also have a very high pagerink score. Actually, what I will also show you now is that in this particular case, what I'm varying here, for example, is I'm keeping the parameter beta the same, but I'm varying the teleport set S.",
    "440-460": " When teleport set S is all the nodes in the graph, these are the traditional pagerink scores. For example, you notice that as I'm decreasing the size of the teleport set and at the end the teleport set only contains of node 1,",
    "460-480": " notice how the pagerink score of node 1 starts to increase and the pagerink scores of all other nodes tend to decrease. Similarly, for example, if I keep the teleport set S constant, but I'm changing the random jump probability or the teleportation probability,",
    "480-500": " you see as the parameter beta gets smaller, the score of the first node, the node where the random walker is jumping to, also starts to increase because more and more often the random walker jumps to node 1, so more and more often the random walker is at that given node.",
    "500-520": " So now one thing that I haven't told you yet is how do we find a topic-specific vector S? How do we find a set of authoritative pages on a given topic? Actually, what we can do is we can go back to the initial efforts of how to organize the web graph. So for example, demos or open directory is a human-curated set of web pages that are categorized into a 16-category top-level hierarchy.",
    "520-540": " So one idea is, for example, is that we go and use the web pages that are classified into this hierarchy as the teleport set S for every given topic.",
    "540-560": " So for example, the idea would be now the following, that for every web page on the web, we have a number of different pagerink scores, one with respect to a given topic. So for every page, we would know what is its quality with respect to arts, what is its quality with respect to business, and so on.",
    "560-580": " So now the question is, as I mentioned before, how do we use this in terms of web search? So one way how we could use personalized pagerink for a web search would be the following. Basically, a user types in a query and picks a particular topic from the menu,",
    "580-600": " whether they're interested in arts or whether they're interested in sports. And then what we can also do is we can classify a query into a given topic. And now, based on this, we can basically show, pick a particular topic and a particular ranking with respect to a given topic. And this is how the whole methodology could be used in real-world settings."
}