{
    "0-20": " Anand je včasih govoril s vami o sistemi recommendatori, in tako daleko smo naučili kako faremno filtrovati sistemi recommendatori in kako faremno faremno faremno sistemi recommendatori. To, co smo na dnešnji lektura učiti, smo gledali na modele recommendatori, na katero ideja boste imeli, eto da učimo oziroma naučenja masina,",
    "20-40": " kod katera boste učili optimizaciju, in kod katera boste učili oziroma recommendatori. Na svoje lekturo, boste bili motivirani Netflixu. Netflix je firma, ki razvija DVD-e, in za pomaganje ključnega ključnega izkušnja,",
    "40-60": " Netflix želi, da bi lahko rekomendirali, kaj ključnih ključnih ključnih filmov. To se imenuje sistema recommendatori filmov. In nekoliko let tudi, Netflix je pripravljal nekaj dana in ustvaril veliko težave, kjer je ideja bila, kaj lahko razvija najboljši sistem recommendatori, in človek, ki ga razvija, ima 1 milijonov dolarov.",
    "60-80": " Tako se je razstvarjala kompetizacija. Ideja je bila, da prvič naučitelji bi imeli dana na treningu. To je del dana od 100 milijonov različitelj, od 480 tista ključnih ključnih filmov in okoli 17 tista filmov. To je šest let dana dana, od 2000 do 2005.",
    "80-100": " Združeno s tem danom, ideja je, da razvijamo ali razvijamo sistem recomendatori filmov, in potem pripravljamo te različitelje Netflixu, ki bo razvijao naše različitele recomendacije, tj. kako veliko ima različitelj, ki ima všeč na filmu, s svojim testom, ki je set različitelj,",
    "100-120": " ki ima samo Netflix, in tako želimo različiti in ustvarjati, da različitele različitelje razlikajo na pravih različiteljih ljudi, ki imajo všeč na filme. Tako se je ideja. Imamo 100 milijonov različitelj filmov, in želimo razvijati sistem recomendatori filmov. Tako da možemo misliti naši različitelje data",
    "120-140": " na različitelji različitelja različitelja, in način, kako se različitelj razvija, je, da različitelje različitelje različitelj filmov in različitelje različitelj ljudi. Testa različitelja, veliko od njega je nekaj, v razmišljanju, da veliko ljudi ne so videli več različitelj filmov. Ampak, ko vidi ljudi film",
    "140-160": " in različitelj različitelj filmov, to razpresenta otvaranje se tej matriči. Zdaj, napr. to otvaranje se tisto element zametni čevLink šef 5 bi manjavela, da bila clienta v 4 oli ih kolesan ugojil drugo film in tako partilo bo namtal delo na 5 stoljine.",
    "160-180": " Zdaj, v različenost te matrici, želimoh formulirati različitelj različitelja cropne. Tako, kot mislimo različitelj različitelj cropne, je, da želimo prediktati, koliko želimo različitelj različitelj nekaj filma, ki ga bomo videli v prihodnosti. Tako, v tem različitelju lahko uporabljamo historično različitelj",
    "180-200": " za razstavljanje našega modela. To je to, kar nam rečemo različitelj različitelj. Zdaj, uporabljamo to različitelj različitelj, želimo prediktati, koliko želimo različitelj filma, ki jo nismo vedeli, in to nam rečemo različitelj testov. In zdaj, ko rečemo, da želimo prediktati, koliko želimo želimo različitelj filma, tako, kot želimo prediktati, koliko je naša predikcija",
    "200-220": " zgodna, uporabljamo to, kar se imenuje različitelj različitelj. Zdaj, na primer, ideja bo bila, da naš cilj je prediktati, koliko želimo želimo različitelj filma. Zdaj, povedemo tistih želitelj, hej, koliko želite različitelj filma? In zadaj, želimo, da prediktelj in pravi cilj je tako blizu kot je možljivo.",
    "220-240": " Zdaj, različitelj različitelj, tako, kako funziona formula, je tako. Zdaj, za različitelj cilja X in filma I, želimo prediktati, koliko želimo različitelj cilja X različitelj filma I različitelj. Zdaj, znam tudi pravi cilj",
    "240-260": " različitelj Cilja X. In što želimo raditi, želimo, da različitelj različitelj in pravi cilj boste v razmišljanju, da želimo raditi različitelj, različitelj. Razgovarjamo različitelj, ker različitelj može biti pozitiv in negativ. Zato, ko različitelj različitelj, vse je pozitivno. Zdaj, razlijamo",
    "260-280": " vse te različitelje preko vseh ključov in vseh filmov. Razlijamo različitelj in razlijamo na celo nomor različitelj. To je zvan različitelj različitelj različitelj. Zato, v nekom različitelju, naš cilj je prepletiti to različitelj, kjer so različitelje neznamne, in naš cilj je",
    "280-300": " prepletiti to različitelj tako akuratno kot je možno. Zato, v nekom različitelju, želimo predikovati koliko bo različitelj všeč različitelju. Zato, kakšen je vpis in kakšen je vpis? Zato, što nam daje Netflix je različitelj na 100 milijona različitelj, tj. ponoške jedne milijone ljudi s milijonom filmi",
    "300-320": " in različitelji. Goritva je prediktovati prv82 različitelj v svem gospodju, kjer rasskratenje različitelje je podločno z različitelem vpisl različitelj različitelja v pislu razmišljena",
    "320-340": " pri Netflixu na malo pri jazzah je vinil 0,95, v nekaj različitih različiteljih. Na različitih različiteljih je tvoja različita različitelja v pislu okolo jedna star različita od od pravih različiteljov. Srečno? Tako je taj različitelj, ko je se odločil v roku 2009",
    "340-360": " in 2010, više kot 2700 skladatelje so se skladali na različitelj, in to, če je Netflix tako reče, je, tko je možno različitelj različitelja različitelja v pislu na 10%, ima različitelj na 1 milijon dolarov. Reci? Tako da ideja je, kako možemo kako možemo zbiti različitelj različitelja v pislu in otvoriti",
    "360-380": " različitelj različitelja v pislu od 0.9 do 0.85. To je to je cela ideja. Sedaj struktura kako to raditi je tako. Na primer, modernna različitelja različitelja danes je odločena od različiteljih različiteljov. Ideja je, da na primer, želimo odločiti",
    "380-400": " različitelj različitelj. Ideja je, da želimo predstaviti različitelje različitelj od tega globala različitelja različitelj do neke različitelje različitelja različitelj do sredno interakcije med filmi in uputnjami. Tako da",
    "400-420": " celo današnja lečeza bo bila to da pričakujemo na na različitelj ali različitelj različitelj različitelj različitelj predstavljenjem matričnih faktorizacij. Tako da metodologija, ki jih bomo uspjeli da razvijamo našo različitelj, bo bila matrična faktorizacija, ki se zelo dobro razvija na različitelj različitelja različitelj",
    "420-440": " in različitelj različitelj različitelj, ki smo govorili predstavljeno. Ampak pred početkem do globalnega različitelja današnjega lečeza povedam vam o globalnem različitelju in tako pa o skoropodobnem različitelju, ki je zelo lokalna različitelj Tako kaj znam globalnega različitelja različitelja?",
    "440-460": " Globalna različitelj različitelja je na primer, da želimo nekako različitelj različitelj različitelj na filmi in tako pa na uživljenja Pravda? Tako da ako bismo uspjeli globalno različitelj različitelj koliko bo različitelj všeč različitelj tako bi mogli reči različitelj različitelja na na našem različitelju",
    "460-480": "",
    "480-500": " različitelj različitelj na različitelj razlikitelj",
    "500-520": " različitelj različitelj pa različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj rad li ki moja različitelj različitelj",
    "520-540": " različitelj različitelj različitelj različitelj različitelj različitelj",
    "540-560": " različitelj različitelj različitelj različitelj različitelj različitelj razlikitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različiteļ različitelj različitelj različitelj različitelj razlikitelj razlikitelj razlikitelj različitelj različitelj različitelj različitelj razlikitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj različitelj And based on this,",
    "560-580": " I would then make a recommendation, right? And based on these kinds of signals, I would then make a final estimate that Joe is like going to like our movie or rate it with 3.8 stars. OK, so how does collaborative filtering do what I just said? The idea is basically the following, is that we want to derive",
    "580-600": " unknown ratings from those from the ratings of similar movies, right? This is the item item based collaborative filtering. So now the big question with collaborative filtering is how do we operationalize the notion of similar, right? So I basically need to define a similarity measure that tells me how similar",
    "600-620": " are movies i and j. And now that I, that for every pair of movies, for example, I'm able to measure the similarity, then the idea is the following. Given that I want to make a recommendation for movie i, the way I would do this is I would go find k nearest neighbors, basically k most similar movies to movie i. And then I would ask the ratings",
    "620-640": " and add them together in a weighted combination where movies that are more similar to my movie i, they have a higher weight. So this is the formula that I have at the bottom. So let me explain it, right? So what we want to do is we want to predict how much will user x like movie i. The way we do this",
    "640-660": " is that for a given movie and for we go and find, let's say, k nearest neighbors, meaning k most similar movies j to this query movie i. And then we say, what was the rating that this user x gave to that given movie i? And then we also multiply this",
    "660-680": " with the similarity between movie i and j, right? So the idea basically is that if movies i and j are very similar, then Sij will be high. So the rating that user x gave to movie j will have a high weight. If the movie j is of low similarity with i, then what will happen is that that rating of user x",
    "680-700": " to the movie j will have a low weight in this summation. And then at the bottom, we just normalize, right? And this is one way how we can compute the rating based on the collaborative filtering. Now, how do we put together the local effects",
    "700-720": " and the global effects, right? How do we combine collaborative filtering with the global effects model that I described two slides ago? The way we do this is that basically we just add the two together, right? So here's the formula that I will explain again, right? So my recommendation or prediction of how much",
    "720-740": " will user x like movie i is the baseline predictor, which is what we talked before, right? So the baseline predictor for user x and movie i is simply the average movie rating plus the average deviation for user x plus the average deviation",
    "740-760": " for movie i, right? So in our previous case, B of x was minus 0.2 because our user Joe was very critical. And in our case, the sixth sense was a good movie. So the bias of that movie was 0.5 and the overall rating was 3.7, right?",
    "760-780": " So our baseline recommendation for Joe at that point in time was 4.0. And now, of course, this is our baseline recommendation. And now we can take the part from the collaborative filtering where we take K near closest movies J to the given movie i and ask what is the deviation",
    "780-800": " of the user's rating with regard to their baseline for that movie and take a weighted combination of this and compute the recommendation, right? So here the first part is the global part of the model and the second part is the collaborative filtering",
    "800-820": " part of the model. Of course, here are a few caveats, a few things to be careful about. First one is that coming up with a good similarity measure, basically the good Sij, is very hard. In some sense, it's arbitrary or one has to try many different metrics before one starts to work.",
    "820-840": " The problem with pairwise similarities is that basically they consider the similarities between the movies, but they kind of ignore the similarities between the users. And another thing here we could say is that taking this weighted average sometimes can be restricted.",
    "840-860": " But these are kind of, if there are some issues with this model, these are the three to talk about. But in practice, this already works quite well. So let me show you how well do these different models work. So what I'm showing you with this yellow arrow is what is the performance of various methods on this Netflix price. For example, if for a given user,",
    "860-880": " we would just go and predict the global average. So we would just compute what is the global average star rating on the whole Netflix data set. And whenever a user comes, we would just say 3.7. That's our prediction. If we do that, our root mean square error would be 1.12. So if you are kind of very naive",
    "880-900": " and don't even look at the user, just always give the same recommendation, our root mean square error would be 1.12. If, for example, for every user, we would say we don't even care what is the movie this user is going to watch. We will just go and predict the average rating for that movie. That already decreases the error.",
    "900-920": " So if for every user, we just predict what's their average rating, that reduces the error to 1.06. Now, for example, I told you before that the Netflix recommender system was at 0.95. So kind of much better than these naive global models.",
    "920-940": " But for example, the simple collaborative filtering that I told you before already beats the Netflix model. So the collaborative filtering that we just talked about gives you the score of 0.94, which is one percentage point better than the Netflix model. Of course, the million dollar",
    "940-960": " model is down here. We need to be at 0.85. And what we will do now in the rest of the videos on recommender systems, we will learn how to basically go all the way down to here and how kind of win $1 million. So right now, collaborative filtering is at 0.94. The question is,",
    "960-980": " what kind of methods can we use to get all the way down and reduce our error to 0.85? So that's the idea."
}