{
    "0-20": " Kodo smo definirali matriksu Laplacianu grafu, počinjamo samo na to, kako potrebujemo Laplacianu grafu da potrebujemo dobro partizano našeg grafu. Na primer, želimo vrati na naš originalno problema, kjer želimo naći, kako razvijati grafo na dva stranice, tako da iloščina stranic, katera croštuje dva stranice, bude mala. Na primer, nekako to faremo,",
    "20-40": " če razmišljamo, kakšne so eigenvalije a eigenvektore na matriksu Laplacianu grafu, kakšna je svoja značajnost. Pomembno je to, če razmišljamo, če razmišljamo, kakšna je značajnost dva stranice, katera je najminjša. Potrebno je pokazati, da je dva stranice",
    "40-60": " najminjša značajnost razmišljena na različnih problemah. Pomenjamo, da je M matrič, katera je X vektor, na kateri želimo različiti. Na primer, L2 je različna na različnih problemah, ali želimo različiti X transpozalno različno M različno X različno X transpozalno različno X.",
    "60-80": " Na primer, L2 je različna na različnih problemah. Na primer, L2 je različna na različnih problemah. Pomembno je to, kakšna je značajnost na naši različnih problemah na Laplaciju grafu, kakšna je značajnost X transpozalno L različno X. L ima značajnost matriča M.",
    "80-100": " Kakšna je značajnost oto expresi, kjer imam matričo X, različeno s L, in potem različno različno z X od letnega strana. Različno je to, kakšno značajnost ima različno X transpozalno različno L različno X.",
    "100-120": " To je samo različno različno Lij Xij Xj. Različno različno različno Lij Xij Xj. Postavimo dobro, kakšna je definicija L. Tez definicija L je samo različno matrično različne",
    "120-140": " in zato za drugo del vse, če moramo,",
    "140-160": " se spominjamo, kaj je A različno X in A različno X je samo sum vrška različnih prijatelj, tako da je to samo razlika na sve razliki našega matriča in težko, ker imam Xij, vidim to dvajkrat, tako moram raditi dvajkrat Xij različno Xj.",
    "160-180": " Tako je težko, kako možemo razvijati celo produkt od začetka, ampak začnemo prodajati menje o tebellično različno X. Stvari, kar možemo, neke pa razvihotnje. Pa upoznajamo razlikno različno X. ănidar potrebeno različno X je samo nomena različna različna različne različne različe.",
    "180-200": " Za straju razvernja različnic answer različne različne različne različne različne različne različne različne različne različne različne različne različne različne raslične različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne",
    "200-220": " različne različne različne različne različne različne različne različne različne različne različne različne različne različne razliki različne različne različne različne različne podemoso različne različne različne različne različne različne različne različne različne različne različne različne",
    "220-240": " različne različne različne različne razliki različne različne različne različne različne različne različne različne različne različne različne različne razliki različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne razliki različne različne različne različne različne različne različne razliki različne različne",
    "240-260": " različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različne različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različnirazlični različni",
    "260-280": " razlijšče različni različni različni al Intro upočacevajo hklasicu in šikancijo uradne in nekaj ne morao vsi kraje. Zahtuva po sobi srečno pa domač spomegati o toga, da gleda nekje preiganovstvene tkolu.",
    "280-300": " Če vspaš se povarljaju srečni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različnirazlični različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni",
    "300-320": " različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni različni Drawing",
    "320-340": " NE Zdaj, ker je X ortogonalno s tem vektorom vseh različnih, to znači, da ko napravim dot produkt X s vektorom vseh različnih, moram dobiti zero. To znači, da",
    "340-360": " različne vrste naših X mora povezati do zero. Zdaj, imamo dva stvari. Prvi je, da različne vrste naših vektorov X mora povezati do 1 in različne vrste naših X mora povezati do zero. Ok? Zdaj, povratimo se na naš problem originalno, kaj je vrsta",
    "360-380": " lambda 2 in kaj je različen vektor X. Rekli smo, da je to X razloženo različno L različno X. Zdaj, sva se razvila, da prva dela je samo razloženje preveč vseh različnih vreta.",
    "380-400": "",
    "400-420": " Tako što možemo misliti o ovom minimizacijskom problemu je samo da idemo na minimizaciju svojeg sredstva noći i tako da je sum sredstva svih noći ima 0 i što stvarimo je da radimo svoje sredstva tako da je sum sredstva sredstva",
    "420-440": " ima 1 i želimo minimizirati vremenu diskrepancija s sredstvama noći i puno. U nekom slučaju to znači da moramo misliti o tome kao što stvarimo je da imamo noće na našoj grafički g, tako da ovdje je naša grafička g, želimo staviti neke noće na",
    "440-460": " pravom stranu od 0 i želimo staviti neke noće na pravom stranu od 0, ako to mislim kao stvarno značaj. I sad htjevamo staviti neke noće na pravom stranu od 0 i neke noće na pravom stranu od 0 jer potrebamo sum sredstva x",
    "460-480": " da bude ispred 1, tako da moramo da imamo to. Razlog za to da ne možemo staviti sve noće na jednom stranu ili sve noće na drugom stranu je jer želimo da bude sum jednostavnih komponenta x ispred 0. To znači da za svaki neki noć koji stavljamo na pozitivnu stranu pravog stranu moramo staviti nešto na negativnu stranu, tako da se cijela stvar odloči.",
    "480-500": " I sad idemo i misliti o tome što je naš problem minimizacije. Naš problem minimizacije je da želimo minimizirati sumu različitosti noća na sve strane. To znači da želimo da imamo na sve strane",
    "500-520": " sve noće na pravom stranu jer imam negativnu stranu minus minus negativnu stranu, tako da različitost će biti mala ili želim to raditi za noće koje su konektirane i su na pravom stranu od 0. Znači da su noće konektirane, tako da ima pozitivnu stranu minus pozitivnu stranu.",
    "520-540": " A ako mislimo kada ćemo biti penalizirani ovdje u sumu različitosti je kada imamo stranu koja kreće 0. U ovom slučaju ćemo imati pozitivnu stranu i negativnu stranu. Znači će to sumirati sa svojim slučajem. Znači to što to znači je da je ovaj problem minimizacije",
    "540-560": " toga što se stavlja, stavlja noće na grafu, stavlja su ih na pravom stranu u tako vremenu da je numero strani koje kreću prema 0 tako malo kako je moguće, sada su noće koje su konektirane s svojim slučajem u samom stranu pravog stranu.",
    "560-580": " I to je nekako to što želimo raditi. Želimo minimirati numero strani koje kreću, sada želimo staviti neke noće na pravom stranu i neke noće na pravom stranu. Znači, što je pomešanje? Pomešanje je da je eigenvektor koji se koristio s drugim najminijim eigenvektorom našeg grafa Laplacija i L, stvarno radi pravu stvar. Stvarno se stavlja da stavlja noće na noće,",
    "580-600": " tako da neke noće imaju pozitivnu stavlju, neke noće imaju negativnu stavlju i suma diskrepancija noćne stavlje u svih stranah je tako malo kako je moguće. Stvarno, što smo naučili, je da možemo povrći s našim stvarnim optimizacijskim problemom i da možemo izdjelovati kako naći optimalnu stavlju u slučaju.",
    "600-620": " Mislimo da je yi binarni eigenvektor, gdje plus jedno znači da je noće i koriste s pravim stranom particije, a minus jedno znači da je noće i koriste s pravim stranom particije. Možemo misliti o setu A i setu B.",
    "620-640": " Ideja je da možemo minimizirati korijenje particije načinom non-trivialnog vektora x, koji minimira slučajne stavlje. Stvarno, stavljac je, da ću napraviti stavlje plus jedno i minus jedno na svih noća u stavlju, u takoj stavlji da je suma na kraji stavlja, yi minus yj2, tako malo kako je moguće.",
    "640-660": " Stvarno, to što reći je da ću napraviti stavlje na pravom stranu, u kojem se neke stavlje možu imati samo koordinaciju minus jedno, druge stavlje možu imati samo koordinaciju plus jedno, a što bih htio da radim je, ako se stavlje konekiraju i su sve u jednom stranu, ću imati,",
    "660-680": " počnemo reći, minus jedno minus minus jedno je 0, tako da ću imati neku penalizaciju. Stvarno, jedini čas koji ću imati penalizaciju ovdje, će biti kada jedna od stavlja je na pravom stranu i jedna od stavlja je na pravom stranu. Što to znači? To znači da način kako naćemo penalizaciju je da stavljamo neke stavlje na pravom stranu,",
    "680-700": " neke stavlje na pravom stranu, u takom mojstvu da cijelost križenja dvije strane je najmišljena. To je prvo obzirano i napravljeno od Fiedlera u 1973. Stvarno, što naučimo je da možemo prilagoditi naš problem.",
    "700-720": " Zbog misljenja da možemo samo stavljati stavlje na pravom stranu i napraviti na njihove stavlje minus jedno i jedno, zapravimo da napravimo na njihove stavlje stavlje koje su stvarno križene. To znači da je naš prvo minimizacijski problem, koji je ovaj F od Y, i reći smo da idemo minimizirati",
    "720-740": " sumu diskrepancije stavlje na stavlje na kraju. To je samo kao rečenje, to je Y transpozirano, naša laplacijska matrička L x Y. Stvarno to znači da, kao što sam prije pričao, stavljamo stavlje na pravom stranu i na pravom stranu od 0, u takom mojstvu da su sum stavlje na stavlje na 0,",
    "740-760": " sum stavlje na stavlje na 1, i želimo minimirati sumu različitosti na kraju, što znači da želimo da imamo mnoge kraje koje su samo na jednom stranu od 0 i nekoliko krajev koje se krozu među dvije stavlje.",
    "760-780": " Stvarno znamo što je slučaj na ovaj način problema o minimizaciji. Znamo da je lambda 2 slučaj ili vrsta u kojoj je ovaj minimiziranje odločeno, i stvarno znamo da je vektor koji odločuje ovaj problem o minimiziranju drugi mnogošći eigenvektor,",
    "780-800": " a ovaj vektor se zove Fiedler vektor, ili povode na imenu Fiedler vektora. Stvarno to znači da je komponente ili labirante vektora koje dođu od drugog mnogošćeg eigenvektora će nam reći kako, kakve vektore da stavljamo u jednu stavlju i kakve vektore da stavljamo u drugu stavlju."
}