{
    "0-20": " I za jednostavnost, razbavimo se o regularnim graficima. To znači da smo zanimljeni graficima u kojih svaki not je na drugom nivu, to znači da svaki not ima na drugom nivu svoje srećenje. To je samo za jednostavnost, sve samo radi i za druge grafice, više interesantne, ali razmišljajmo za sve grafice u kojih svaki not ima na drugom nivu,",
    "20-40": " to znači da ima na drugom nivu srećenje. Znači, možemo začeti pitanje o njih, što su njihove srećenje i srećenje vektora u ovoj regularnoj grafici G. I mislimo, ovdje je naša ekvazija koju želimo praviti. A je naša srećenja matrička, X će biti naš srećenje vektor i lambda je odgovorni srećenje večarja.",
    "40-60": " Znači, sve što pitamo je što su neke slučaje za ovu matričku ekvaziju, u kojoj A je dodano, kada želimo načiniti lambda i X. Znači, pitanje je, što je lambda i što je X? Znači, da probujemo, na primer, da X je srećenje svih jednostavih. Znači, da mislimo da želimo probati da li srećenje svih jednostavih je eigenvektor našeg matričke ekvazije.",
    "60-80": " Stvarno, ako to mislimo, što se stvari, jednostavno rećemo, OK, što je A x X? Znači, znamo da A x X je jednostavno za sve srećenje. Pitaju, što su njihove srećenje mojih srećenja i uključuju sve srećenje. Znači, u našoj d-regularnoj grafi, sve srećenje ima stvarno d-srećenje",
    "80-100": " i sve srećenje imaju labirinu jednog. To, stvarno, znači da kada sve srećenje razlije srećenje svojeg srećenja, cilj tog srećenja je d, stvarno? Znači to da je A x X kratka za sve srećenje imaju cilj d. Stvarno, to znači da smo učinili našu soluciju, stvarno? Učinili smo naš eigenvektor problem,",
    "100-120": " jer možemo reći da je to srećenje x, kada je srećenje d i x srećenje sve srećenje, stvarno? Stvarno, smo učinili naš eigenvektor problem i što smo učinili je da smo našli srećenju srećenja na našoj srećenje matriči A u grafi g,",
    "120-140": " stvarno da je x srećenje sve srećenje je eigenvektor i stvarno srećenje srećenja je srećenje s ciljem d. Stvarno, možemo se povjetiti što ako naš srećenji graf, stvarno, nije srećen. Stvarno, u poprvoj različitosti smo učinili našu simplicitnu osjećaju da je srećenje sve srećenje d i da je naš graf srećen.",
    "140-160": " Stvarno, povjetimo što ako naš graf nije srećen. Pomenijmo da naš graf ima dvije srećene komponente i svaki je srećen. Stvarno, ovdje na hradu imam način dvije srećene komponente u kojoj imamo dvije srećene komponente. Stvarno, imamo dvije različite grafe koje ne su srećeni s svojim drugim",
    "160-180": " i svaki je srećen. Stvarno, ovo je dvije regulirane grafe. Stvarno, stvarno, što su njihove eigenvektore i eigenvaluze ovog grafa ovdje na hradu? A ako se povjetimo o tome, stvarno, možemo koristiti intuiciju od poprvog slijeda, u kojem možemo reći, ok, stavljamo sve ciljeve 1 na sve srećene komponente A",
    "180-200": " i stavljamo sve ciljeve na srećene komponente B u našoj grafi G ovdje. Stvarno, ako se povjetimo o tome, što se naučimo? Stvarno, ako se povjetimo vektor x prime koji ima uvijek s ciljevom 1 na sve srećene komponente A i uvijek 0 na sve srećene komponente B,",
    "200-220": " stvarno, ako se povjetimo A različite x, stvarno, što stavljamo je stavljamo sve srećene komponente B ovdje na srećene komponente A i stavljamo sve srećene komponente B u vijek ili srećena komponenta. U A sve srećene komponente imaju vijek 1, stvarno, ako se stavljamo sve srećene komponente A imamo vijek D. U vijeku B",
    "220-240": " sve srećene komponente imaju vijek 0, stvarno, ako se stavljamo sve srećene komponente A imamo vijek 0. Stvarno, ali što vidimo je stvarno da smo znovu našli izlijučenu vijeku. Stvarno, izlijučen vijek je išto D i stvarni vijek je ovdje. Stvarno, analogno ili simetrično, možemo raditi stvarno stvarno gdje stavljamo sve vijeke",
    "240-260": " 0 ili stavljamo 0 na srećene komponente A i sve vijeke 1 na srećene komponente B i znovu, ako radimo A različito x'' stvarno stavljamo stvarno stvarno vijek i znovu imamo vijek vijek D. Stvarno, što smo naučili, je da u sveh različitih različitih razlika imamo dvije različite vijeke,",
    "260-280": " prvi koji ima vijek 1 i sve vijeke 0, drugi koji ima prvi vijek 0 i sve vijeke 1 i u sveh razlikah stvarno stvarno vijek ima D. Stvarno, ako imamo malo intuicije, što smo naučili, je da imam različitu razliku koja ima dvije završene komponente, zato imam stvarno vijek",
    "280-300": " lambda ima D na različitosti 2, to znači da ima dva stvarno vijeka stvarno vijek D prvi stvarno vijek je x prime i drugi stvarno vijek je x duble prime. Znači, ako se intuitivno mislimo o tome i pitamo, ok, što bi se stvarno,",
    "300-320": " što bi se stvarno ako naš graf s ovim komponentima A i B bi bilo završeno. Znači, što ako imamo različitu razliku kao što imam ovdje na pravom, kada imam nekoliko razlika krozavršenja među A i B. Znači, stvarno naš intuicija bi bilo da možda bi bilo nekaj različitih med timi različitima. Znači, ne bi imel",
    "320-340": " različitih D z mnogostnostjo dva, ali bi imel različitih, različitih lambda jedna in lambda dva, ki so pravilo pravilo stvarno, znači, so pravilo podobne, ker je za vse praktične potrebe na početku naš graf ima skoraj dva završene komponente, znači, imam samo nekoliko različitih krozavršenja od strane A do strane B,",
    "340-360": " ali nekako to skoraj izgleda kot različitih komponenti, samo da je stran, ki ga skoraj završi ali nekaj, znači, tako da bi očakal, da boste dva različitih boste pravilo stvarno, ali boste imali podobno zvršenje, in to tako tako znači, da so različitih X in X",
    "360-380": " država nekako boste naši različitih, znači, tako da je ako naš graf je završen, vemo kaj boste različitih boste. Ako graf bo nekako završen,"
}