{
    "0-20": " Dakle, začnimo odbuduvanje na ovoj intuiciji i začnimo misliti o tome kakva je prava grafica, matrička reprezentacija koja nam pomoći koristiti ovo intuicije od poprvog slijeda. Tako da smo učinili grafice, matrička koja je nxn matrička, gdje n je lica nodov, i jednostavno rečemo da je aij1",
    "20-40": " ako nod i liči na nod j, a zbog toga ima cilj 0. Zbog različiteg grafice g ovdje, to je matrička aj, koja je binarna aj, gdje cilj 1 znači da je lica nodova lična, a cilj 0 znači da nije. Što su neke priče ovog spektra ili",
    "40-60": " eigenvalija i eigenvektora ovog aj matrička? Prvo, ovo je simetrična matrička, jer naš graf je nedokončen, a zbog toga, eigenvektore našeg aj matrička su stvarni, znači su stvarno kvalificirani, i su ortogonalni za definiciju. To so dva pomembne predstavke, ki se bomo naredili najprej.",
    "60-80": " To je zdaj definicija ajmatričnega matriča. Zbog toga, ustvarjamo to, če imamo cilj matrički D. Zbog različiteg grafice g, cilj matrički D je samo različna matrička, kjer je cilj različnega noda različno cilj našeg aj matričke. Zbog toga, na našem pripadu, je cilj 1",
    "80-100": " različno cilj 3, ki je različno cilj našeg aj matričke. To znači, da imamo tukaj na cilju n3, 1, 1 na našem cilju matričku cilj 3. To je zdaj definicija cilja matričke. Zdaj, če smo pripravljeni različno cilj matričke, možemo različno različno različno cilj matričke.",
    "100-120": " To je prosto cilj različno cilj matričke, na katero različno različno cilj matričke razložimo kot L, in L je prosto cilj matričke minus različno cilj matričke. Zdaj, imam matričke, na katero različno cilj imam različne cilje cilje matričke, in na različno cilj imam binarni vremeni, tj. 0 in nebojša.",
    "120-140": " Zelo znači, da ne je različna cilja matrička različno cilj, in nebojša znači, da je različna cilj matrička različno cilj. Kaj so nekaj pravila te matričke? Na primer, jedna pravila, ki jih znamo, je, da različno cilj vremeni v kažem cilju",
    "140-160": "",
    "160-180": " je različno cilj vremeni v kažem cilju. Vsi moji vremeni imajo različno cilj minus 1, tako da imam minus D. Na različno cilju imam različno cilj D, tako da to znači, da je L različno X različno 0, to znači, da je lambda 1, tj. najminša različna cilja",
    "180-200": " različne cilje različne cilje različno cilj. Kaj so druge pomembne pravila te matričke? Prvo je, da so različne cilje različne cilje, a drugo je, da so različne cilje pravilične in različne cilje. Različno cilj znači, da ko",
    "200-220": " jih radim na različno cilj različne cilje, jih različno cilj je 0."
}