{
    "0-20": " Sada ćemo govoriti o spektrografnom particijalnosti. Spravit ćemo diskusiju o spektrografnom particijalnosti u dvije dele. Prvo ćemo govoriti o problemu, kod kojeg ćemo razmišljati matričinu Laplacija, a sada u drugoj deli ćemo govoriti o tom kako raditi particijalnost. Znači, prije toga razmišljajmo što je naš cilj i što želimo raditi.",
    "20-40": " Što želimo raditi? Želimo razmišljati klustre ili komunitete u netvorkama. Sada ćemo razmišljati klustre u dvije dele. Sada ćemo razmišljati klustre u dvije dele u tako jezicu da su svi dvije dele imali mnogo konekcija među jednim delom i nekoliko konekcija koji se razmišljaju u dvije dele.",
    "40-60": " Ovdje vam dajem način tog, u kojem vam pokazujem način nekog netvora s dvije klustre i malom sezonom konekcija koji se razmišljaju u dvije klustre i samo izgled samoh dana, ali sada izgled sezonne konekcije. Ovo je sada na pravom stranu zvano zadanim sezonom konekcija, u kojem sezone i kolumne ove konekcije",
    "60-80": " razmišljaju koneke. A zato je uvijek ij i j sada uvijek uvijek uvijek uvijek uvijek uvijek. A ako je uvijek uvijek uvijek, znači da se jedan konekciju i sve zanima jednom konekcijom j i ako je uvijek ovdje ispun, znači da se koneke ne zanima s svojim drugim. I u predstavljanju konekcija",
    "80-100": " vidimo da je ovaj konekcijski matrič možda povrđeno u tako vremeno da imamo dva konekcija u kojem su mnogo konekcije među mjestom konekcija. Ovdje je još jedan, mnogo konekcija i zato je mnogo konekcija među dva konekcija u ovdjezadnim delima. Znači, sada je vjerovatno kako se identificiramo takvu strukturu, kako se razvijemo grafom u dva stvara.",
    "100-120": " Odmah ćemo misliti o tome da ćemo razvijesti graf u dva stvara tako da se rezultate stvare imaju lošu konduktaciju. Učinili smo učinjenu noću konduktacije koju je intuitivno možda možda kao za jednu stvar konekcija. Htjelo nam biti pitanje koliko konekcija su povrđene u ovom stvaru konekcija",
    "120-140": " i koliko konekcija su u ovom stvaru konekcija. Znači, u ovom slučaju jedna dobra bisekcija grafa bi bila stvarna strana ovdje. Znači, sada je pitanje kako ćemo uopće naći takvu dobra particiju. Znači, da vam dajem graf i vas pitam kakva je najbolja particija grafa u dva stvara",
    "140-160": " tako da konduktacija svega stvara je najmišljaka moguće to znači da naćemo dobra komunitije ili dobra klustre. Znači, učinili smo noću grafovog konekcija. Znači, reći smo da ćemo denovirati A kao konekcija grafovog konekcija i ovaj konekcij A ćemo reći da će biti",
    "160-180": " binarna matrička s ciljima možda 0 ili 1 kada cilj 1 znači da je jedan kod noći I i J konekcija i cilj 0 znači da ne su konekcije. To je prvi stvar koji ćemo razmišljati. Drugi stvar koju ćemo razmišljati je značaj vektora X. Znači, razmišljajte vektor X kao večer",
    "180-200": " večera stvarača cilja vektora je stvarno samo kao",
    "200-220": " Pitanje je što se događa kada imam večeru i razmišljam",
    "220-240": " s našim vektorom. Znači ovdje imam našu večeru A imam naš vektor X i imajte da je A razmišljajte X je Y. Pitanje je kako moram misliti o večeru i cilju večera s večerom s večerom s večerom znači jako jednostavno idem za svu cilju razmišljam s vektorom X",
    "240-260": " Znači, večer je samo produkt za sve kolumne A u kjer imam i i i i i i i i i i i i i i i i",
    "260-280": " i i i i i i i i i i i i i i i i i i i i i i i i i i i i i i i i",
    "280-300": "",
    "300-320": "",
    "320-340": " i i",
    "340-360": " i i i i i i i i i i i i i i i i i i i i i i",
    "360-380": " So now So now spectral graph theory What do we define as spec? what do we define as spec? Is simply",
    "380-400": " by their magnitude by their magnitude and its corresponding If I have our graph. I compute the eigenvectors and eigenvalues matrix as lambdas eigenvectors as axes the question is what do these eigenvectors and eigenvalues what do they tell me about the graph?",
    "400-420": " So let's now start thinking about what do eigenvectors and the corresponding eigenvalues what do they tell us about the graph?"
}