{
    "0-20": " In today's lesson, lecture, we will talk about community detection in graphs. So let me give you an example of what do I mean by this. So imagine we are given a protein-protein interaction network. So here in this network, I have proteins, proteins in a cell, and I connect to proteins if they interact, basically if they work together in a cell to synthesize various other proteins",
    "20-40": " or regulate things and so on. So if I have a protein interaction network, imagine I want to go in and detect functional modules, right, kind of sets of proteins that work together in a cell. So the way I would want to do this is, here is the visualization of the network, is to basically go and use this idea of finding clusters in networks to identify these modules.",
    "40-60": " What you see here in this case is that these modules can actually overlap with each other in the network. So let's also look at another example of what are we going to learn today. So this is an example of a Facebook friendship network. So this is a friendship network of one of my students. So basically, these are all his friends, and then the two of the friends are connected",
    "60-80": " if they are linked to each other in the Facebook network, right? And the goal here would be to ask is, what is the structure of my student's social network, and what are the communities, the social communities in this network? And the way I visualize the network here, you could start thinking about, OK, what is the structure? And what, for example, we see here is we could postulate that maybe here, just visually,",
    "80-100": " right, that here is a cluster of nodes. Maybe it looks like here would be another cluster of nodes. Something separate seems to be down here, and so on, right? So what our goal would actually be to go and automatically detect these clusters. Let me actually now show you what our method will be able to detect.",
    "100-120": " And actually, what we find in this network is very different from this visualization that I just showed you. So if you actually go and ask, can I detect social communities in this network, the student whose social network we are looking at, he went to it, and he told us that there are four communities of his friends that he has, right? There is a set of his high school friends.",
    "120-140": " There is a set of friends he made at summer internships at various companies around Stanford. There is a community of his friends to whom he's playing squash together, and another community of Stanford friends where he basically plays basketball with them. What you also notice from this picture is that these communities heavily overlap.",
    "140-160": " So for example, this area here is the overlap of the squash and the basketball communities, right? And the friends here are his Stanford friends who went to the same high school as my student. They also spend some time at the same companies and also play sports together, right? So we see that these social communities interact with each other.",
    "160-180": " So kind of the difference from what we have been doing last time was we were thinking about how do we partition graphs, right? So we had this left picture in mind where the idea is that we have a network and the nodes in the network join into these groups where we have lots of edges between the members of the group and kind of few edges to the rest of the network.",
    "180-200": " And our goal was to identify these kinds of clusters in the network using the specter clustering approaches and so on. Our view for today will be the idea that we have networks where communities actually overlap with each other, where we have nodes, for example, the red nodes in this picture that",
    "200-220": " actually belong to multiple groups at once. So that's basically what we are trying to do in today's segment. So the idea is the following, right? The question is how should we think about communities in networks or how should we think about how different groups overlap? And the insight we will be using is the idea that two groups, when they overlap, basically",
    "220-240": " people that belong to multiple groups, they are more likely to be friends with each other. So in some sense, we will think of these communities or these groups as styles, right? So here on the left, I show you a small hypothetical example of how two groups could overlap with each other. And the red nodes that are in the overlap of the two groups, they are more likely or",
    "240-260": " more strongly to be connected with each other. And then the picture here with these dots, this is what is called a graph adjacency matrix. So basically, the way we can think of a network is that the network is a big matrix where an empty spot means that a given pair of nodes is not connected and a dot means that a given",
    "260-280": " pair of nodes is connected. So if I pick a node in the row i and a particular node in column j, then I ask what is the value in the corresponding i, j entry. And if that value equals zero, then I know i and j are not connected. And if that entry equals one, then I know the two nodes are connected.",
    "280-300": " And the way we drew the edges in this example is that zeros are empty spaces and ones are these shaded squares, right? What do we see in this case is we have two groups, right? The two groups overlap and the nodes, this is this set of nodes that belongs to both",
    "300-320": " of the groups, they have more edges among themselves, the shade is darker than the nodes that belong to only one of the groups. So that's the idea that what we want to exploit or how do we want to do this. So in a sense, we can think of communities or clusters in networks as tiles, where the",
    "320-340": " idea is that the more groups overlap in a certain region, the thicker the tiles, the more edges are there in the network. And what we would like to do is, using this kind of view of the network, we would like to go and basically take out these tiles one by one from the network. So that's kind of what we want to do."
}