{
    "0-20": " Skozići o latent-factor recommender sistemi. Prima ideja latent-factor recommender sistemi je, da budemo misliti o rekomendacijah kot problem optimizacije. A modem, na kateri mislimo, o problem optimizacije, je, da mislimo rekomendacije kot predikcija ratinga. A potem optimizacija je, da želimo nauči",
    "20-40": " metoda, katera nam daje najbolje predikcije ratinga. Tako da tu je globalna ideja. Globalna ideja, ili cel, je, da želimo nauči rekomendacije. Skozi, kako govorili smo o dobrosti rekomendacija, je, da uživamo način zgodnih zgodnih nevod. Ideja je, kot je menjša način zgodnih zgodnih nevod način rekomender sistemi,",
    "40-60": " kot je dobro rekomendacije. Zato, kaj želimo, je, da želimo nauči rekomendacije na iteni, ki nismo včasih videli ljudi. Zato, želimo predikti v budućnosti, kaj ljudi se bojajo. Zato, ne možemo to tako, ker ne smo neprofeti, ne znamo leta. Zato,",
    "60-80": " ko je treba da smo spokojni, je druge stvar. Še vedno, želimo razbila sistem, ki je možen prediktati svetovine, ki smo tudi imeli. Način, kaj znam z tem, je, da imamo svojo svetovino matriče, gledamo na nje nekoliko dobrosti, in naš cel je prediktati te svetovine dobro. Način,",
    "80-100": " da to razberemo, če zalazime rekomendacijo sistem na Netflixu, da bi to sistem delalo dobro za čisto neznamne svetovine. Način, kako mislimo s svetovino predikcijo za rekomendacije je tako.",
    "100-120": " Imamo svojo svetovino matriče s ključami in filmami, in naš cilj je, da želimo razbila sistem, ki predikuje dobro svetovine. Zato imamo razbila s svetovino matriče in je",
    "120-140": " naš cilj razbila sistem, kjer za vse svetovine razbila dobro svetovino na celu. Zato želimo razbila znači in razbila svetovino. Ideja je,",
    "140-160": " da sistem, kjer tko imamo razbilo s svetovino razbila",
    "160-180": " nastopamo razbila in razbila s svetovino nastopajo razbila s have no no no s dev dev s dev s dev",
    "180-200": " dev s s s dev d dev dev S S S S S S S O O O O O",
    "200-220": " S S S S S S S S S S S S S S S S S S S S",
    "220-240": " S S S S S S S S S S S S S S S S S S",
    "240-260": " S S S S S S S S S S S S",
    "260-280": " S S S S S S",
    "280-300": " S S S S S S S",
    "300-320": " S S S S S S S",
    "320-340": " S S S S S S",
    "340-360": " S S S S S S S",
    "360-380": " S S S S S S S",
    "380-400": " S S S S S S",
    "400-420": " S S S S S S S",
    "420-440": " S S S S S S S",
    "440-460": " S S S S S S",
    "460-480": " S S S S S S S",
    "480-500": " S S S S S S",
    "500-520": " S S S S S S S",
    "520-540": " S S S S S S S",
    "540-560": " S S S S S",
    "560-580": " S S S S S S",
    "580-600": " S S S S S S S",
    "600-620": " S S S S S S",
    "620-640": " S S S S S S S",
    "640-660": " S S S S S S",
    "660-680": " S S S S S S S",
    "680-700": " S S S S S S S",
    "700-720": " S S S S S S",
    "720-740": " S S S S S S S",
    "740-760": " S S S S S S",
    "760-780": " S S S S S S S",
    "780-800": " S S S S S S",
    "800-820": " S S S S S S",
    "820-840": " S S S S S S S",
    "840-860": " S S S S S"
}