{
    "0-20": " Tako da, so far, govorili smo o singular value decomposition, videli smo, da daja nam najbolja možna projekcija v radu errora rekonstrukcija, onda videli smo tudi, da so dva vrata. Prva vrata bila computacionalna, da treba veľa vremena za computaciju, vremena kubicka za computaciju,",
    "20-40": " a druga problema bila, da resultati, katere dostanemo, so te dense vektore, ktore potrebuje veľa spasov, a so srečne za interpretaciju. Tako, decompozicija CUR je različna tehnika redukcija dimenzionalnosti. Govorimo o njej nastopno in, na prostor, to postane prekvapenje neke tiste",
    "40-60": " razvijanje singularne vrte decompozicije. Tako, kaj je naš cilj? Na zgodu, naš cilj je veľa podoben na cilj, kjer smo imeli singularne vrte decompozicije. Tako, znova, imamo matriču A in želimo jej predstaviti kot produkt tri matriče. Te tri matriče imajo na imenu C, U, R in, podobno s svojim ciljem na SVD,",
    "60-80": " naš cilj bude tukaj, da želimo, da različina med stvarno dato in razvijano dato bude tako mala kot je mogoče. Čim singularna vrta decompozicija nam daje optimalnosti in reče, da je to najboljšo, če to lahko radimo, tukaj se bomo izvolili nekaj, možda,",
    "80-100": " imati veľašši razvijanje, ali, veš, na veľa manjšem razvijanju. Način, na katero se bomo mislili, je tako, mi smo mislili, da smo predstavljeni matriči A kot vrta, želimo jej predstaviti kot produkt tri specialne matriče, C, U, R, in,",
    "100-120": " kot s singularna vrta decompozicija, bomo postavljali nekaj obzorov na strukturo matriče C in R. Način, kako to obzorov radimo, je zelo zanimljiv. Pogledajmo, kako postavljamo obzorov na C in R. Način je tako, obzor na našem matriču C je, da je mora predstavljati kolumne",
    "120-140": " od matriče A. Način, kako predstavljamo matriče C, je, da bomo ozbiljno ali s nekim algoritmom pripravili del kolumni od matriče A in jih postavljamo na matriče C. Naš matrič C je prosto del kolumni od A. Podobno, pripravimo matriče R in radimo to stesso,",
    "140-160": " ale zdaj za vrte. To znači, da pripravimo del kolumni od matriče A in jih postavljamo na R. Zato, zato imenujemo matriče R, R, ker R imenuje kolumne in zato imenujemo matriče C, C, ker C imenuje kolumne. Zato, što radimo tako dalje, je, da radimo matriče A",
    "160-180": " kot produkt od tri drugih matriči, kjer matriče C predstavljajo prosto kolumne od A in matriče R predstavljajo kolumne od A. In zdaj, zato je vprašanje B, kaj je matriče U? Tako, način, kako bomo kompilirali matriče U, je, da bomo kompilirali to, če se imenuje pseudo-inverz",
    "180-200": " intersekcije C in R. Pripravljam to v večji detalj. Zato je v prstu različno ideja. Zato je to dobra ideja, ker selektiranje kolumnih in kolumnih da se predstavljamo C in R bo bilo nekaj, če bi mogli to raditi veliko večno. To znači, da boste različno in veliko lepo. Ok.",
    "200-220": " Zato je vprašanje, kako C in R različno je s SvD in če se C in R različno radijo nekaj našega pomočnega. Zato prvič, razumemo slično razloženje. Razumemo, da je A sub k najboljša različna k na našo vzdušnjo matriče A. Veseli smo, kako kompilirati A sub k. To kompiliramo s SvD,",
    "220-240": " to znači, imamo matriče A, stavemo razabromanje različneha razloga, prijedemo prvo k največji razloga, ustvarjamem res na zero in najrežimo tri matriče in odnumavamo K sub A. Ako rećem najboljše, znamo že, kar znači najbolje. Najbolje znači ako posluža norma Zachvale,",
    "240-260": " ko To znači, da A spozna H sob k ako po glavu norma je najmanjša mogče. Ko res Mahony in Rene predstavljavali plod jevio kvalita razloga na razloga SvD. Teorema reče, da je razloga nekaj manjšega",
    "260-280": " nekaj manjšega razloga SvD plus nekaj epsilon razloga norma A. Znači, norma A reče kako je velika razloga v matriči A in celo teorema reče, da razloga nekaj",
    "280-300": " nekaj razloga na razloga SvD. To bo nekaj razloga na razloga SvD, ki je najbolj možno razloga, ki bi mogli očistiti. Kaj so tiste poslagi za to prezostavljanje? Če volimo, če če SvD može prezostavljati k kolumni",
    "300-320": " in k razlogi, možemo prezostavljati razloga na razloga na razloga prezostavljati k k razloga na razloga razloga na razloga razloga kolumni in k razloga razloga na razloga na razloga razloga na razloga razlogi, kjer možem",
    "320-340": " misliti da razloga je nekaj malo in možem tudi misliti da razloga je mala kvaliteta. Seveda što je pomembno da znamo tukaj, je da to je probabilistična prezostavljanja ki reče, veste, ta prezostavljanja tukaj, ta prezostavljanja bo pravda s probabilnosti na najmanje 1 minus delta. In, ali to, če je pomembno, je da, na primer,",
    "340-360": " tukaj sestavljamo kvalitetu razloga na razlogu, ali razloga je veliko malo. Zato razloga da to je od razloga m razloga n, ki, na primer, je razloga na našem razlogu, in to je veliko meno kot to ki imali za SVD, kjer kjer smo imeli to kot m razloga n razloga. Ok?",
    "360-380": " Zato što to znači? To je nekaj komplikatnega teorema, ali što to znači, je, da na pravda imamo oko 4k razlogi in kolumni, in imamo tako dobro kot SVD ima ko SVD ima k razlogi in kolumni. Zato CUR potrebuje više od tiste, ali to bo pomembno strukturo v real data, ko"
}