{
    "0-20": " Per dotiči informacija, potrebujemo prvotno definirati koncept entropi. Entropi, da lahko govorimo, to znači, kakšna je najminša možnost bitov na početku, katera moramo transmitirati nekaj symbola, tako da, kajnekaj symbola,",
    "20-40": " kateri se odvajaju od distribucija X. Ideja je, kako veliko zvukov je distribucija X. Ideja je, kako izmešavamo entropi? Reklamo, da je entropija različnega distribucija X samo minus, sumacija na vse možnosti, kajnekaj distribucija ima,",
    "40-60": " probabilnost, katera ima kvartiček, kvartiček, katera ima kvartiček. Intuicija je zelo semna. Kajnekaj distribucija ima veliko entropi, to znači, da je probabilnost distribucija X različna. V nekaj različnih različinah je to nekaj zlato.",
    "60-80": " Vse je plasto, vse ima stvarno probabilnost. Kako bi stvarovalo histogram, to distribucije bi bilo plasto. Na prvi različi, distribucije z zelo semno entropijo so zanimljive, ima veliko kvartiček. Ideja je, da je, kako plovim histogram distribucija z zelo semno entropijo,",
    "80-100": " kako bi mleo ošalač pipe, ki bi bilo prečasno. Na kום si radite, ko je disturbacija z zelo semno entropijo, to je zelo teško preobraziti pretrez predodo, in ako je disturbacija z zelo semno entropijo, Na našem razliki imam aljume odosbe na plovesu.",
    "100-120": " Na pilise so organizacije, ki bilo ani mutno poplozevane celi temelji Okока. To je ustvarem preatrobe, kako je zelo teško preobraziti, kaj so doti, ali v razliki na slajde, kjer imam vse doti v jedno delo stvarja, je zelo lepo preobraziti lokacijo doti. To je razlika",
    "120-140": " z zelo semno entropijo. Na primer, ideja je, da predodo preobrazimo, kako je uniforno, kako je spremenjeno ali kako je bobojno različno predodo. Ako je zelo semno entropijo, različno predodo je zelo preprosto. Zato predodo, ki imajo zelo semno entropijo, je zelo lepo preobraziti.",
    "140-160": " Zato, ko imamo koncept entropije, dajte mi dajte vam napravu. Imajte, da želim predodati cilj Y, ali imam dodatno X. Na različno, imajte, da X je kolega, a Y je, če ljudje ljubi gladiator ali ne. Zato, moja data je del X-Y razlika, kjer X",
    "160-180": " je gladiator, a Y, če ljudje ljubi gladiator ali ne. Zato morem začeti vzpostavljati, kakšne so entropije v tem različnih različnicah. Na prvi predosti, imajte, da želim vzpostaviti, kakšna je entropija Y. Predstavljanje entropije Y je lepo. Moja Y ima dva razlika, da je da ali ne.",
    "180-200": " Zato, prvo, moram vzpostaviti, kakšna je probabilnost, da Y ima razliku da. Zato moram predstaviti, če to je razlika 0,5, zato 4 iz 8 razlik je da. Zato je razlika 1,5 razlika log razlika 2, 1,5. Zato moram predstaviti, koliko razlika Y ima druga razlika, ne razlika, zato je razlika 1,5 razlika.",
    "200-220": " Zato je razlika 1,5 razlika razlika log razlika 2 razlika 1,5. Zato, v celom, entropija Y ima razlika 1,5. Na podobno možnost moram predstavljati entropijo X. Entropija X ima",
    "220-240": " razlika razlika razlika",
    "240-260": " razlika",
    "260-280": " razlika vidim da je na polo valze da, a na polo valze ne, tako da",
    "280-300": " koristimo stvarne razliki, kot smo to dalo na poprvo sliče, valze je jedno, na prvom sliče, mogu sva zastaviti, kaj je entropija Y, različno da X je zgoden na istorijo, tako da imam vse istorije, tu so, oba ima valze ne, tako da to je",
    "300-320": " različna razlika, srečno, vse je stvarno različna razlika",
    "320-340": " Mogemo generalizirati tisto concepto in definirati condizionalna entropia.",
    "340-360": " Odpravljamo, da je condizionalna entropia zelo semplična. Sve, če gremo preko domena na različno variabilno x, razgovarjamo, kakšna je probabilnost x, katera ima različno variablo, različno entropija y na različno x. Tako da to je entropija y na različno x. To je semplično",
    "360-380": " različno condizionalno entropijo y, kjer različnosti so probabilnosti ali različno različno x ima različno različno y. Pogledajamo semplično pripravljanje različno entropije. Ideja je, da različno entropijo y na različno x je različno različno entropijo y.",
    "380-400": " Imamo formilo. Na prvi slično, če pregledamo svojo današnjo tablo tu na slično, možemo stvariti različno entropijo tablo, kjer moja cilja je različno entropijo y na različno x. Zato za svojo različno različno x moram razlijati kaj je različno različno x. To imam tu. In zato za svojo različno različno x",
    "400-420": " moram razlijati kaj je različno entropijo y. Za različno različno x imam to tablo in potem samo radim razlika na razlice in na našem razliku različno entropijo y na različno x bude 0.5. Tako da smo odstranili svoje različne različnosti, smo srečni za govoriti o različno različno različno x.",
    "420-440": " In razlika na različno različno x nam reče slišno. Na različno različno x nam reče, če želimo različno y. Koliko razlic bi srečali na različno različno x ako bi svoje različne različnosti znali x? Zato je ideja, kaj je na presetnosti različno različno x predstavljeno, kaj je različno različno y",
    "440-460": " in kaj je različno različno y kaj je različno različno x, ki smo včasih znameli x. X nam reče o y. Tako da y je naša razlika. Vidimo kaj je naša entropija y i zato rečemo koliko će se ovaj različanje entropije ako ja idem i različno različno x vam rečem.",
    "460-480": " I, na primer, odgovorimo na naš različanje, na našu datu, svi znamo da je entropija y je 1. Svi znamo da je entropija y različno x je 0.5. Zato je informacija različanje y različanje x je 0.5. Znači, ideja je da u našoj razliki",
    "480-500": " ćemo za svi različanje x sub i idemo i komputiramo što je različanje y različanje x sub i. Zato ćemo razlijati svoje različanje sa različanjem različanje i htjelo bimo razlijati različanje koje imaju vrlo vrlo različanje.",
    "500-520": " Različanje imaju vrlo vrlo različanje s različanjem y. Zato, da vam dajem način misliti o tome, imajte da stvarimo da različimo čim će neko žiti prvo 80 godina. Znači, imamo ovo različanje problemu gdje rećemo je li ćeš žiti više od 80 godina ili ne. Imajte da koristimo neke historijske data,",
    "520-540": " informacije različanje koje ćemo komputirati će biti nešto kao to. Ako rećem različanje, što je informacija različanja bojanje živu, odučenje ratka, ovdje je resnih ratknutija za različanje. Odučenje ratka recimo ne reče veliko o probabilitieselini kako dolgo će kako dalo možda živjeti.",
    "540-560": " Naprije, vidjel smo da ako nekte pišu ili neskako gbud comparisons recimo zbog koja je nakako dolođa. Naprije papier đevanje u Zrlanjskoj Zrlnje ili ili zbog kako dolgo će",
    "560-580": " kako dalo živjeti. U prvom, ne reče nam ništa. Znači, cijela ideja o informacijom različanju je da nam reče koliko informacija o cijelom variaciju y je opravljena ili u X. Znači, atribut y koji ima vrlo vrlo različanje",
    "580-600": " je atribut na koji želimo različiti kada stvarimo u našem slučaju."
}